<?php
// +----------------------------------------------------------------------
// | Sample控制器数据验证器
// +----------------------------------------------------------------------
// | 每个控制器一个验证器，scene场景中对应控制器中的每个方法
// +----------------------------------------------------------------------
// | Author: qh.cao@knowyourself.cc
// +----------------------------------------------------------------------
namespace app\v1\validate;

use think\Validate;

class Sample extends Validate
{
    protected $rule = [
        'company_id' => 'require|alphaNum',
    ];

    protected $scene = [
        'index' => [''],
    ];
}
